tutorials/precice/monolithic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          16;
        startFace       103031;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       103047;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          573;
        startFace       103167;
    }
    atmosphere
    {
        type            patch;
        nFaces          429;
        startFace       103740;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          103600;
        startFace       104169;
    }
)

// ************************************************************************* //
